#### `success` Terraform Format and Style
#### `success` Terraform Initialization
#### ️`success` Terraform Validation
#### `success` Terraform Plan
#### Please check the service here: http://myservice-test-187807313.us-east-2.elb.amazonaws.com

<details><summary>Show Plan</summary>

```terraform
[0m[1mmodule.webserver_cluster.aws_vpc.myservice_vpc: Refreshing state... [id=vpc-071a049bdc2aa43b3][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_b: Refreshing state... [id=subnet-028be2579a582a0ac][0m
[0m[1mmodule.webserver_cluster.aws_internet_gateway.gw: Refreshing state... [id=igw-066b3a9a4d4283838][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_a: Refreshing state... [id=subnet-0cdb8347832c5d00e][0m
[0m[1mmodule.webserver_cluster.aws_security_group.elb: Refreshing state... [id=sg-042bd0665799e8a6c][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_c: Refreshing state... [id=subnet-06b7e68450bee03ca][0m
[0m[1mmodule.webserver_cluster.aws_route_table.r: Refreshing state... [id=rtb-0dcc22b4f7ee47dfb][0m
[0m[1mmodule.webserver_cluster.aws_elb.myservice: Refreshing state... [id=myservice-test][0m
[0m[1mmodule.webserver_cluster.aws_db_instance.myservice-db: Refreshing state... [id=terraform-20210325155327045800000001][0m
[0m[1mmodule.webserver_cluster.aws_launch_configuration.myservice: Refreshing state... [id=myservice-test][0m
[0m[1mmodule.webserver_cluster.aws_autoscaling_group.myservice: Refreshing state... [id=myservice-test][0m

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[0m
Terraform will perform the following actions:

[1m  # module.webserver_cluster.aws_db_instance.myservice-db[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_db_instance" "myservice-db" {
      [33m~[0m [0m[1m[0mdb_subnet_group_name[0m[0m                  = "default" [33m->[0m [0m(known after apply)
        [1m[0mid[0m[0m                                    = "terraform-20210325155327045800000001"
        [1m[0mname[0m[0m                                  = "myDBtest"
        [1m[0mtags[0m[0m                                  = {}
        [90m# (42 unchanged attributes hidden)[0m[0m
    }

[1m  # module.webserver_cluster.aws_db_subnet_group.myservice[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_db_subnet_group" "myservice" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m = "Managed by Terraform"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "myservice-rds-subnet-group"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_ids[0m[0m  = [
          [32m+[0m [0m"subnet-028be2579a582a0ac",
          [32m+[0m [0m"subnet-06b7e68450bee03ca",
          [32m+[0m [0m"subnet-0cdb8347832c5d00e",
        ]
      [32m+[0m [0m[1m[0mtags[0m[0m        = {
          [32m+[0m [0m"Name" = "myservice DB subnet group"
        }
    }

[1m  # module.webserver_cluster.aws_elb.myservice[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_elb" "myservice" {
        [1m[0mid[0m[0m                          = "myservice-test"
        [1m[0mname[0m[0m                        = "myservice-test"
      [33m~[0m [0m[1m[0msecurity_groups[0m[0m             = [
          [32m+[0m [0m"sg-042bd0665799e8a6c",
          [31m-[0m [0m"sg-0cfe344cc25a7327a",
        ]
        [1m[0mtags[0m[0m                        = {}
        [90m# (13 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mhealth_check {
          [33m~[0m [0m[1m[0mtarget[0m[0m              = "TCP:22" [33m->[0m [0m"HTTP:80/"
            [90m# (4 unchanged attributes hidden)[0m[0m
        }

      [32m+[0m [0mlistener {
          [32m+[0m [0m[1m[0minstance_port[0m[0m     = 4000
          [32m+[0m [0m[1m[0minstance_protocol[0m[0m = "http"
          [32m+[0m [0m[1m[0mlb_port[0m[0m           = 80
          [32m+[0m [0m[1m[0mlb_protocol[0m[0m       = "http"
        }
      [31m-[0m [0mlistener {
          [31m-[0m [0m[1m[0minstance_port[0m[0m     = 80 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0minstance_protocol[0m[0m = "http" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mlb_port[0m[0m           = 80 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mlb_protocol[0m[0m       = "http" [90m->[0m [0m[90mnull[0m[0m
        }
    }

[1m  # module.webserver_cluster.aws_main_route_table_association.a[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_main_route_table_association" "a" {
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0moriginal_route_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m          = "rtb-0dcc22b4f7ee47dfb"
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                  = "vpc-071a049bdc2aa43b3"
    }

[1m  # module.webserver_cluster.aws_route_table_association.a1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "a1" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = "rtb-0dcc22b4f7ee47dfb"
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = "subnet-0cdb8347832c5d00e"
    }

[1m  # module.webserver_cluster.aws_route_table_association.a2[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "a2" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = "rtb-0dcc22b4f7ee47dfb"
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = "subnet-028be2579a582a0ac"
    }

[1m  # module.webserver_cluster.aws_route_table_association.a3[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "a3" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = "rtb-0dcc22b4f7ee47dfb"
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = "subnet-06b7e68450bee03ca"
    }

[0m[1mPlan:[0m 5 to add, 2 to change, 0 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pusher: @behoof4mind, Action: `pull_request`, Workflow: `Create PR Env`*